[
	{
		"date": "04-28-2023",
		"title": "Self Employed",
		"description": "Seeking for New Opportunity I Can Really Contribute to the World!",
		"icon": "feather:briefcase"
	},
	{
		"date": "04-25-2020",
		"title": "Joined in Coinbase",
		"description": "Worked as a Blockchain Developer in Coinbase",
		"done": [
			"Designed and developed 5+ decentralized applications on Ethereum, Polkadot, and Binance Smart Chain using Truffle, Remix, and Web3.js.",
			"Led the development of a supply chain management application for a major food processing company that resulted in cost savings of $500K/year and improved transparency for customers.",
			"Integrated front-end interfaces with blockchain networks to create seamless user experiences and increased user engagement by 30%.",
			"Collaborated with cross-functional teams including product managers, designers, and business stakeholders to deliver high-quality products on-time and within budget."
		],
		"icon": "feather:briefcase"
	},
	{
		"date": "02-15-2019",
		"title": "Changed way to Blockchain!",
		"description": "Started working as a Blockchain Consultant at Yojee.",
		"done": [
			"Conducted technical feasibility assessments and advised 15+ enterprise clients in industries such as finance, healthcare, and logistics on blockchain adoption strategies.",
			"Evaluated 10+ different blockchain protocols and platforms and helped clients navigate regulatory and compliance issues related to blockchain implementations.",
			"Developed proofs-of-concept and prototypes for 5+ clients to demonstrate the potential of blockchain technology in solving specific business problems.",
			"Worked closely with clients to understand their needs and requirements and provided customized solutions that resulted in an average cost saving of $200K/year per client."
		],
		"icon": "feather:briefcase"
	},
	{
		"date": "07-20-2015",
		"title": "First Developer Role",
		"description": "Started career as a Full Stack Developer working at Lightcurve.",
		"done": [
			"Built and maintained 10+ web applications using modern JavaScript frameworks like React and AngularJS.",
			"Developed 20+ RESTful APIs to connect front-end interfaces to back-end services.",
			"Created and managed 5+ relational databases using SQL and NoSQL technologies like MySQL and MongoDB.",
			"Implemented Agile development methodologies including Scrum and Kanban to ensure timely and efficient delivery of products.",
			"Worked closely with 10+ stakeholders to gather requirements, identify areas for improvement, and implement solutions that increased user satisfaction by 20%."
		],
		"icon": "feather:briefcase"
	},
	{
		"date": "06-04-2015",
		"title": "Got Bachelor's Degree",
		"description": "Graduated Hong Kong University of Science and Technology",
		"icon": "feather:award"
	},
	{
		"date": "05-10-2011",
		"title": "Entered University",
		"description": "Began Studying Mathematics and Computer Science at The University of Hong Kong",
		"icon": "feather:book"
	},
	{
		"date": "03-30-1993",
		"title": "Birthday!",
		"description": "I was born on 30th of March 1993",
		"icon": "feather:gift"
	}
]
